In [1]:
import pandas as pd

In [2]:
import numpy as np

In [29]:
data = {'name':['a','b','c','d','e','f', np.nan], 'location':['hyd','BLR','BLR','hyd','BOM','bom',np.nan], 'sales':[1000,2000,1000,1500,'15%08', '13$03',np.nan], 'profit':[10,20,30,'2E3','ER34', 40,50]}

In [30]:
df1 = pd.DataFrame(data)

In [7]:
df.shape

(7, 4)

In [6]:
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        6 non-null object
location    6 non-null object
sales       6 non-null object
profit      7 non-null object
dtypes: object(4)
memory usage: 352.0+ bytes

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40
6  NaN      NaN    NaN     50

In [10]:
df['name'] = df['name'].fillna('a')
print(df)

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40
6    a      NaN    NaN     50

In [12]:
df['location'] = df['location'].fillna('hyd')
print(df)

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40
6    a      hyd    NaN     50

In [13]:
df['sales'] = df['sales'].fillna(3300)
print(df)

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40
6    a      hyd   3300     50

In [14]:
from sklearn import datasets

In [15]:
house = datasets.load_boston()

In [18]:
house

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': ".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n",
 'filename': '/opt/anaconda3/lib/python3.7/site-packages/sklearn/datasets/data/boston_house_prices.csv'}

In [16]:
data_h = house['data']

In [19]:
data_df = pd.DataFrame(data_h)
print(data_df)

           0     1      2    3      4      5     6       7    8      9    10  \
0    0.00632  18.0   2.31  0.0  0.538  6.575  65.2  4.0900  1.0  296.0  15.3
1    0.02731   0.0   7.07  0.0  0.469  6.421  78.9  4.9671  2.0  242.0  17.8
2    0.02729   0.0   7.07  0.0  0.469  7.185  61.1  4.9671  2.0  242.0  17.8
3    0.03237   0.0   2.18  0.0  0.458  6.998  45.8  6.0622  3.0  222.0  18.7
4    0.06905   0.0   2.18  0.0  0.458  7.147  54.2  6.0622  3.0  222.0  18.7
..       ...   ...    ...  ...    ...    ...   ...     ...  ...    ...   ...
501  0.06263   0.0  11.93  0.0  0.573  6.593  69.1  2.4786  1.0  273.0  21.0
502  0.04527   0.0  11.93  0.0  0.573  6.120  76.7  2.2875  1.0  273.0  21.0
503  0.06076   0.0  11.93  0.0  0.573  6.976  91.0  2.1675  1.0  273.0  21.0
504  0.10959   0.0  11.93  0.0  0.573  6.794  89.3  2.3889  1.0  273.0  21.0
505  0.04741   0.0  11.93  0.0  0.573  6.030  80.8  2.5050  1.0  273.0  21.0

         11    12
0    396.90  4.98
1    396.90  9.14
2    392.83  4.03
3    394.63  2.94
4    396.90  5.33
..      ...   ...
501  391.99  9.67
502  396.90  9.08
503  396.90  5.64
504  393.45  6.48
505  396.90  7.88

[506 rows x 13 columns]

In [23]:
#Encoding - To convert any alphabte data into numbers
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df['name'] = le.fit_transform(df['name'])

print(df)

   name location  sales profit
0     0      hyd   1000     10
1     1      BLR   2000     20
2     2      BLR   1000     30
3     3      hyd   1500    2E3
4     4      BOM  15%08   ER34
5     5      bom  13$03     40
6     0      hyd   3300     50

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        7 non-null int64
location    7 non-null object
sales       7 non-null object
profit      7 non-null object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [26]:
df = df.replace('bom', 'BOM')

In [28]:
le = LabelEncoder()

df['location'] = le.fit_transform(df['location'])

print(df)

   name  location  sales profit
0     0         2   1000     10
1     1         0   2000     20
2     2         0   1000     30
3     3         2   1500    2E3
4     4         1  15%08   ER34
5     5         1  13$03     40
6     0         2   3300     50

In [31]:
df1 = df1.dropna()

In [34]:
df1 = df1.replace('bom', 'BOM')
print(df1)

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      BOM  13$03     40

In [36]:
lb_loc = pd.get_dummies(df1['location'])
print(lb_loc)

   BLR  BOM  hyd
0    0    0    1
1    1    0    0
2    1    0    0
3    0    0    1
4    0    1    0
5    0    1    0

In [45]:
#One-Hot Encoding for Location
from sklearn.preprocessing import LabelBinarizer

lb = LabelBinarizer()
lb_location = lb.fit_transform(df1['location'])
print(lb_location)

KeyError: 'location'

In [39]:
df1 = pd.concat([df1,lb_loc], axis = 1)

In [43]:
del df1['location']

In [44]:
df1

  name  sales profit  BLR  BOM  hyd
0    a   1000     10    0    0    1
1    b   2000     20    1    0    0
2    c   1000     30    1    0    0
3    d   1500    2E3    0    0    1
4    e  15%08   ER34    0    1    0
5    f  13$03     40    0    1    0

In [44]:
df['sales']= df['sales'].replace(regex= True, to_replace = '[^0-9]', value = '')
df

  name location sales profit
0    a      hyd  1000     10
1    b      BLR  2000     20
2    c      BLR  1000     30
3    d      hyd  1500    2E3
4    e      BOM  1508   ER34
5    f      bom  1303     40
6    g      NaN   NaN     50

In [40]:
df['profit'].replace(regex= True, to_replace = '[^a-z0-9]', value = '')

0    10
1    20
2    30
3    23
4    34
5    40
Name: profit, dtype: object

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 6 columns):
name      6 non-null int64
sales     6 non-null object
profit    6 non-null object
BLR       6 non-null uint8
BOM       6 non-null uint8
hyd       6 non-null uint8
dtypes: int64(1), object(2), uint8(3)
memory usage: 210.0+ bytes

In [42]:
df['sales'] = pd.to_numeric(df['sales'])

In [40]:
df['profit'] = df['profit'].replace(regex= True, to_replace = '[^0-9]', value = '')
df

   name sales profit  BLR  BOM  hyd
0     0  1000     10    0    0    1
1     1  2000     20    1    0    0
2     2  1000     30    1    0    0
3     3  1500     23    0    0    1
4     4  1508     34    0    1    0
5     5  1303     40    0    1    0

In [49]:
df['sales'] = pd.to_numeric(df['sales'])

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        7 non-null object
location    6 non-null object
sales       6 non-null float64
profit      7 non-null object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [52]:
df

  name location        sales profit
0    a      hyd  1000.000000     10
1    b      BLR  2000.000000     20
2    c      BLR  1000.000000     30
3    d      hyd  1500.000000    2E3
4    e      BOM  1508.000000   ER34
5    f      bom  1303.000000     40
6    g      NaN  1385.166667     50

In [51]:
df = df.fillna(df.mean())

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        7 non-null object
location    6 non-null object
sales       6 non-null object
profit      7 non-null object
dtypes: object(4)
memory usage: 352.0+ bytes

In [55]:
cd Downloads

/Users/kantha/Downloads

In [56]:
lend = pd.read_excel('Lending Data.xlsx')

In [57]:
lend

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
0,NaN,NaN,-1,-2,-3,-4,-5,-6,-7.0,-8.0,NaN,-9.0,-10.0,-11
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,NaN,31949.0,138.0,0.28
2,First Citizens Banchares,NC,2,0.187393,0.49083,3914507,117702,$10B-$50B,378394.0,105081.0,NaN,3536113.0,12621.0,.
3,Wintrust Financial Corp.,IL,3,0.168999,0.383561,2842793,136801,$10B-$50B,800526.0,126455.0,NaN,2042267.0,10346.0,0
4,Zions Bancorp,UT,4,0.117973,0.260577,6231770,52612,>$50B,526206.0,32973.0,NaN,5705564.0,19639.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
94,"*The bank was formerly known as GE Money Bank,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
95,1 TA = total domestic assets held by the lende...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
96,"Source: U.S. Small Business Administration, Of...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN